Tekla Open API Reference for Tekla Structures 2025
AnalysisNode.Support Property
 The support of the analysis node.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisSupport Support { get; set; }
Public Property Support As AnalysisSupport
	Get
	Set
Property Value
Type: AnalysisSupport
See Also
Reference
AnalysisNode Class
Tekla.Structures.Analysis Namespace